blog/content/post/ai-generative.org
+++
title = "08 - AI Engineering from scratch: do autoencoder ao fluxo retificado"
description = "Como máquinas aprendem a criar imagens, áudio, vídeo e 3D a partir de ruído"
date = 2026-05-28T19:00:00-03:00
tags = ["AI", "generative", "diffusion", "gan", "vae", "stable-diffusion", "python"]
draft = true
weight = 1
author = "Vitor Lobo Ramos"
+++


Gerar é diferente de classificar. Classificar é colapsar uma imagem de 150 mil números em um rótulo ("gato"). Gerar é inflar 512 números de ruído em 150 mil números que parecem um gato que nunca existiu. É um problema mais difícil, com mais modos de falha e uma história mais tortuosa. E em 2026, é o campo mais quente da IA.

Este artigo percorre 15 tópicos de IA generativa. Da taxonomia das cinco famílias de modelos até o Visual Autoregressive Modeling (VAR) que prevê escalas em vez de tokens. Você vai entender por que VAEs são o compressor universal, por que GANs perderam a guerra mas ganharam a paz, como difusão transformou ruído em arte, e por que flow matching é o padrão de 2026. Stack: Python pra experimentação, Go pra servir modelos em produção.

* A taxonomia generativa

Todo modelo generativo cabe em uma de cinco famílias. A diferença entre elas é qual parte difícil do problema cada uma escolhe enfrentar.

Modelos autoregressivos (PixelCNN, GPT, VALL-E) fatoram a probabilidade conjunta como produto de condicionais: ~p(x) = p(x_1) * p(x_2|x_1) * ... * p(x_n|x_1..x_{n-1})~. Treino estável e likelihood exata, mas geração é serial e lenta.

Modelos de fluxo normalizador (RealNVP, Glow) aplicam transformações invertíveis que mapeiam uma distribuição simples (normal) nos dados. Likelihood exata, amostragem rápida, mas as transformações precisam ser invertíveis, o que restringe a arquitetura.

VAEs (Variational Autoencoders) aproximam a distribuição latente com um encoder e amostram via decoder. Treino estável, espaço latente estruturado, mas amostras borradas (a KL divergence puxa o posterior pra uma gaussiana, perdendo detalhes finos).

GANs (Generative Adversarial Networks) ignoram densidade completamente. Duas redes jogam um jogo: o gerador cria, o discriminador julga. Amostras nítidas e rápidas (um forward pass), mas treino instável (mode collapse, discriminator-wins, oscilação).

Modelos de difusão e score-based corrompem dados com ruído e aprendem a reverter o processo. Treino estável (uma MSE), amostras de alta qualidade, mas amostragem iterativa (20-1000 passos). Flow matching endireita a trajetória pra 1-4 passos.

* Autoencoders: o compressor universal

Um autoencoder comprime e reconstrói. O encoder reduz uma imagem 512x512x3 a um vetor de 256 dimensões. O decoder reconstrói a imagem a partir desse vetor. Mas o espaço latente não tem estrutura: pontos aleatórios produzem lixo. Você não consegue gerar amostrando do espaço latente.

O VAE resolve isso. Em vez de produzir um código latente diretamente, o encoder produz ~μ~ e ~log σ²~ (média e variância de uma distribuição). O código ~z~ é amostrado dessa distribuição: ~z = μ + σ·ε, ε ~ N(0,I)~. O reparameterization trick faz a amostragem ser diferenciável. A loss tem dois termos: reconstrução (MSE entre input e output) e regularização KL (force ~q(z|x)~ a ficar perto de ~N(0,I)~).

Na inferência, você descarta o encoder e amostra ~z ~ N(0,I)~ direto pelo decoder. As amostras são mais borradas que GANs, mas o espaço latente é suave: pontos próximos produzem imagens similares, e você pode interpolar entre duas imagens caminhando no espaço latente.

O papel do VAE em 2026 não é gerar imagens finais. É ser o compressor de primeiro estágio de todo modelo de difusão latente. O VAE do Stable Diffusion comprime 512x512x3 em 64x64x4. Toda a difusão roda nesse espaço comprimido. Sem o VAE, a difusão em pixels seria 64x mais cara.

* GANs: o jogo que produziu as imagens mais nítidas

Uma GAN é um jogo de soma zero entre duas redes. O gerador ~G(z)~ mapeia ruído pra imagem. O discriminador ~D(x)~ classifica imagens como reais ou falsas. O discriminador quer maximizar ~log D(real) + log(1 - D(fake))~. O gerador quer minimizar ~log(1 - D(G(z)))~. Na prática, usa-se a versão não-saturante (~maximizar log D(G(z))~) porque o gradiente da original some quando o discriminador está ganhando.

O treino alterna: um passo no discriminador, um passo no gerador. O discriminador aprende features cada vez melhores pra distinguir real de falso. O gerador aprende a produzir imagens que enganam essas features. Os dois melhoram juntos até o equilíbrio (fakes indistinguíveis de reais).

Os problemas: mode collapse (o gerador descobre uma imagem que engana e produz só ela), discriminator-wins (discriminador fica bom demais, gradiente do gerador desaparece), oscilação (nenhum dos dois converge). A DCGAN (2015) estabeleceu cinco regras pra estabilizar: convoluções com stride (nada de pooling), BatchNorm nos dois lados, nada de fully-connected, ReLU no gerador, LeakyReLU no discriminador.

Conditional GANs adicionam controle. Em vez de gerar qualquer imagem, você condiciona o gerador e o discriminador num rótulo ou imagem. Pix2Pix usa uma U-Net como gerador (skip connections preservam detalhes) e um PatchGAN como discriminador (classifica patches 70x70, não a imagem inteira, o que é mais rápido e captura textura local). O discriminador vê o par (input, output), forçando consistência entre eles. Uma loss L1 adicional mantém fidelidade ao target. CycleGAN estende pra dados não-pareados com perda de ciclo-consistência: traduza A→B, depois B→A, e o resultado deve ser igual ao original.

StyleGAN desempatou o espaço latente. Em vez de injetar ruído diretamente no gerador, um mapping network de 8 camadas projeta ~z~ num espaço intermediário ~w~. Esse ~w~ é injetado em cada resolução do gerador via AdaIN (Adaptive Instance Normalization), que modula estatísticas de feature com escala e viés derivados de ~w~. Camadas grossas (baixa resolução) controlam pose e identidade; camadas finas (alta resolução) controlam iluminação e cor. O resultado é um espaço onde você pode editar atributos específicos sem afetar outros.

Em 2026, GANs standalone foram substituídas por difusão pra geração de domínio aberto. Mas o treino adversarial sobreviveu como mecanismo de destilação: SDXL-Turbo e SD3-Turbo usam uma loss adversarial pra comprimir 50 passos de difusão em 1-4.

* Difusão: o império do ruído

A difusão virou o backbone generativo universal por um motivo: treina com uma MSE. Sem adversarial, sem mode collapse, sem oscilação. Só regressão.

