blog/content/post/ai-generative.org
** DDPM: destruir e reconstruir**

O processo forward é uma cadeia de Markov fixa: ~x_t = √(1-β_t)·x_{t-1} + √β_t·ε~, onde β_t cresce de 1e-4 a 0.02 ao longo de T=1000 passos. Depois de T passos, ~x_T~ é ruído puro. A mágica: ~x_t~ pode ser amostrado diretamente de ~x_0~ em um passo fechado: ~x_t = √ᾱ_t·x_0 + √(1-ᾱ_t)·ε~, onde ᾱ_t = Π(1-β_s).

O processo reverso treina uma U-Net ~ε_θ(x_t, t)~ pra prever o ruído adicionado. A loss é simplesmente ~||ε - ε_θ(x_t, t)||²~. O modelo aprende a desruidificar um passo. Na inferência, comece com ruído puro ~x_T ~ N(0,I)~ e itere: ~x_{t-1} = (1/√(1-β_t))·(x_t - (β_t/√(1-ᾱ_t))·ε_θ(x_t, t)) + σ_t·z~, onde σ_t controla estocasticidade (σ_t=0 é DDIM determinístico).

#+BEGIN_SRC python
def ddpm_sample(model, T=1000):
    x = torch.randn(1, 3, 64, 64)
    for t in reversed(range(T)):
        t_batch = torch.full((1,), t)
        noise_pred = model(x, t_batch)
        alpha = alphas[t]
        alpha_bar = alpha_bars[t]
        beta = betas[t]
        x = (1 / torch.sqrt(alpha)) * (x - (beta / torch.sqrt(1 - alpha_bar)) * noise_pred)
        if t > 0:
            x += torch.sqrt(beta) * torch.randn_like(x)
    return x
#+END_SRC

** Stable Diffusion: difusão no espaço latente**

Rodar difusão em pixels 512x512 é desperdício. O Stable Diffusion faz difusão no espaço latente 64x64 de um VAE congelado. Redução de 64x em FLOPs. Um encoder de texto (CLIP ou T5) condiciona a geração via cross-attention em cada camada da U-Net ou DiT. Classifier-free guidance mistura predição condicional e incondicional: ~ε̂ = ε_uncond + w·(ε_cond - ε_uncond)~. w=7.5 é o padrão; w=1-3 pra fluxo retificado.

A U-Net está sendo substituída pelo DiT (Diffusion Transformer). Patches do latente viram tokens, e blocos transformer com AdaLN-Zero (conditioning via layer norm adaptativa) processam tudo. SD3 e Flux.1 usam DiT. O text encoder migrou de CLIP-L pra T5-XXL, que entende prompts complexos muito melhor.

** ControlNet, LoRA e edição**

Text alone é insuficiente. ControlNet adiciona controle espacial (pose, profundidade, bordas). Clone o encoder da U-Net, processe uma imagem de condicionamento por ele, e injete os features de volta via conexões zero-conv (inicializadas em zero, aprendem a deslocar). LoRA adiciona controle semântico (estilo, personagem) via deltas de baixo posto nas camadas de atenção: ~ΔW = B·A~ com rank 4-32, treinável em GPU de consumidor, 10-50 MB por adaptador. IP-Adapter injeta embeddings de imagem CLIP diretamente na cross-attention, permitindo condicionamento por imagem de referência.

O toolkit de produção em 2026 é empilhar 2-5 LoRAs + 1-3 ControlNets + IP-Adapter. LoRA swap é sub-segundo por requisição. Serving multi-tenant com hot-swap de adaptadores.

Inpainting regenera uma região mascarada preservando o resto. O modelo recebe entrada de 9 canais: ~[latente ruidoso, imagem fonte codificada, máscara]~. A cada passo reverso, pixels fora da máscara são clampados no valor forward-diffused da fonte. SAM gera a máscara + SD-Inpaint preenche = o pipeline padrão de remoção de fundo.

** Flow matching: endireitando a trajetória**

Difusão segue uma curva de 1000 passos. Flow matching vai em linha reta do ruído aos dados: ~x_t = (1-t)·x_0 + t·ε~. O modelo aprende o campo vetorial ~v_θ(x_t, t)~ que aponta de ~x_t~ pra ~x_0~ via MSE: ~||(ε - x_0) - v_θ(x_t, t)||²~. Treino nunca desenrola a EDO; inferência integra ~dx/dt = v_θ(x, t)~ com Euler determinístico.

Rectified flow adiciona iterações de reflow: gere pares (x_0, x_1) do modelo atual, retreine pra deixar a trajetória mais reta. Dois reflows produzem caminhos quase lineares, permitindo geração em 2-4 passos. Flux.1-schnell (4 passos, ~1.2s em 1024²) é o padrão de produção pra texto-para-imagem rápida. Flow matching + destilação é o default de 2026 pra qualquer modalidade generativa.

* Geração além de imagens

** Vídeo**

Vídeo é um tensor 3D (tempo + 2D espaço). A teoria é idêntica à difusão de imagem, mas o custo é 10-100x maior. Um VAE 3D comprime o vídeo em latentes espaço-temporais. Um DiT processa patches com atenção fatorada: espacial dentro de cada frame, temporal entre frames (evitando O((THW)²)). Sora (OpenAI), Veo (Google), Kling (Kuaishou) e modelos abertos (CogVideoX, HunyuanVideo) usam essa arquitetura. O gargalo de produção é banda de memória.

** Áudio**

Áudio a 16-48 kHz gera sequências longas demais pra atenção direta. A solução: um codec neural (EnCodec, DAC, SoundStream) comprime o waveform em tokens discretos a 50-75 Hz via Residual Vector Quantization (RVQ). Um decoder-only transformer gera a sequência de tokens autoregressivamente (domina streaming) ou um modelo de flow matching gera em paralelo (melhor qualidade musical). MusicGen, Suno, ElevenLabs, todos usam codec + transformer.

** 3D**

Geração 3D é um problema de duas etapas. Primeiro, gere múltiplas visões 2D consistentes com difusão multi-view (Zero123, MVDream). Depois, ajuste uma representação 3D (Gaussian Splatting: nuvem de ~1M gaussianas com posição, covariância, opacidade e cor harmônica) pra casar com essas visões. O forward render projeta gaussianas 3D em elipses 2D e faz alpha compositing; o backward otimiza os parâmetros por gradiente descendente. Meshy 4 e Rodin Gen-1.5 pra assets de jogos; Hunyuan3D 2.0 pra e-commerce.

