ai-generative/index.html
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
DDPM: destruir e reconstruir**
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>
O processo forward é uma cadeia de Markov fixa: <code>x_t = √(1-β_t)·x_{t-1} + √β_t·ε</code>, onde β_t cresce de 1e-4 a 0.02 ao longo de T=1000 passos. Depois de T passos, <code>x_T</code> é ruído puro. A mágica: <code>x_t</code> pode ser amostrado diretamente de <code>x_0</code> em um passo fechado: <code>x_t = √ᾱ_t·x_0 + √(1-ᾱ_t)·ε</code>, onde ᾱ_t = Π(1-β_s).</p>
<p>
O processo reverso treina uma U-Net <code>ε_θ(x_t, t)</code> pra prever o ruído adicionado. A loss é simplesmente <code>||ε - ε_θ(x_t, t)||²</code>. O modelo aprende a desruidificar um passo. Na inferência, comece com ruído puro <code>x_T ~ N(0,I)</code> e itere: <code>x_{t-1} = (1/√(1-β_t))·(x_t - (β_t/√(1-ᾱ_t))·ε_θ(x_t, t)) + σ_t·z</code>, onde σ_t controla estocasticidade (σ_t=0 é DDIM determinístico).</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">ddpm_sample</span><span class="p">(</span><span class="n">model</span><span class="p">,</span> <span class="n">T</span><span class="o">=</span><span class="mi">1000</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">x</span> <span class="o">=</span> <span class="n">torch</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span> <span class="mi">3</span><span class="p">,</span> <span class="mi">64</span><span class="p">,</span> <span class="mi">64</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">for</span> <span class="n">t</span> <span class="ow">in</span> <span class="nb">reversed</span><span class="p">(</span><span class="nb">range</span><span class="p">(</span><span class="n">T</span><span class="p">)):</span>
</span></span><span class="line"><span class="cl">        <span class="n">t_batch</span> <span class="o">=</span> <span class="n">torch</span><span class="o">.</span><span class="n">full</span><span class="p">((</span><span class="mi">1</span><span class="p">,),</span> <span class="n">t</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="n">noise_pred</span> <span class="o">=</span> <span class="n">model</span><span class="p">(</span><span class="n">x</span><span class="p">,</span> <span class="n">t_batch</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="n">alpha</span> <span class="o">=</span> <span class="n">alphas</span><span class="p">[</span><span class="n">t</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">        <span class="n">alpha_bar</span> <span class="o">=</span> <span class="n">alpha_bars</span><span class="p">[</span><span class="n">t</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">        <span class="n">beta</span> <span class="o">=</span> <span class="n">betas</span><span class="p">[</span><span class="n">t</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">        <span class="n">x</span> <span class="o">=</span> <span class="p">(</span><span class="mi">1</span> <span class="o">/</span> <span class="n">torch</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="n">alpha</span><span class="p">))</span> <span class="o">*</span> <span class="p">(</span><span class="n">x</span> <span class="o">-</span> <span class="p">(</span><span class="n">beta</span> <span class="o">/</span> <span class="n">torch</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="mi">1</span> <span class="o">-</span> <span class="n">alpha_bar</span><span class="p">))</span> <span class="o">*</span> <span class="n">noise_pred</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="k">if</span> <span class="n">t</span> <span class="o">&gt;</span> <span class="mi">0</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">            <span class="n">x</span> <span class="o">+=</span> <span class="n">torch</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="n">beta</span><span class="p">)</span> <span class="o">*</span> <span class="n">torch</span><span class="o">.</span><span class="n">randn_like</span><span class="p">(</span><span class="n">x</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">x</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Stable Diffusion: difusão no espaço latente**
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>
Rodar difusão em pixels 512x512 é desperdício. O Stable Diffusion faz difusão no espaço latente 64x64 de um VAE congelado. Redução de 64x em FLOPs. Um encoder de texto (CLIP ou T5) condiciona a geração via cross-attention em cada camada da U-Net ou DiT. Classifier-free guidance mistura predição condicional e incondicional: <code>ε̂ = ε_uncond + w·(ε_cond - ε_uncond)</code>. w=7.5 é o padrão; w=1-3 pra fluxo retificado.</p>
<p>
A U-Net está sendo substituída pelo DiT (Diffusion Transformer). Patches do latente viram tokens, e blocos transformer com AdaLN-Zero (conditioning via layer norm adaptativa) processam tudo. SD3 e Flux.1 usam DiT. O text encoder migrou de CLIP-L pra T5-XXL, que entende prompts complexos muito melhor.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
ControlNet, LoRA e edição**
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>
Text alone é insuficiente. ControlNet adiciona controle espacial (pose, profundidade, bordas). Clone o encoder da U-Net, processe uma imagem de condicionamento por ele, e injete os features de volta via conexões zero-conv (inicializadas em zero, aprendem a deslocar). LoRA adiciona controle semântico (estilo, personagem) via deltas de baixo posto nas camadas de atenção: <code>ΔW = B·A</code> com rank 4-32, treinável em GPU de consumidor, 10-50 MB por adaptador. IP-Adapter injeta embeddings de imagem CLIP diretamente na cross-attention, permitindo condicionamento por imagem de referência.</p>
<p>
O toolkit de produção em 2026 é empilhar 2-5 LoRAs + 1-3 ControlNets + IP-Adapter. LoRA swap é sub-segundo por requisição. Serving multi-tenant com hot-swap de adaptadores.</p>
<p>
Inpainting regenera uma região mascarada preservando o resto. O modelo recebe entrada de 9 canais: <code>[latente ruidoso, imagem fonte codificada, máscara]</code>. A cada passo reverso, pixels fora da máscara são clampados no valor forward-diffused da fonte. SAM gera a máscara + SD-Inpaint preenche = o pipeline padrão de remoção de fundo.</p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Flow matching: endireitando a trajetória**
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>
Difusão segue uma curva de 1000 passos. Flow matching vai em linha reta do ruído aos dados: <code>x_t = (1-t)·x_0 + t·ε</code>. O modelo aprende o campo vetorial <code>v_θ(x_t, t)</code> que aponta de <code>x_t</code> pra <code>x_0</code> via MSE: <code>||(ε - x_0) - v_θ(x_t, t)||²</code>. Treino nunca desenrola a EDO; inferência integra <code>dx/dt = v_θ(x, t)</code> com Euler determinístico.</p>
<p>
Rectified flow adiciona iterações de reflow: gere pares (x_0, x_1) do modelo atual, retreine pra deixar a trajetória mais reta. Dois reflows produzem caminhos quase lineares, permitindo geração em 2-4 passos. Flux.1-schnell (4 passos, ~1.2s em 1024²) é o padrão de produção pra texto-para-imagem rápida. Flow matching + destilação é o default de 2026 pra qualquer modalidade generativa.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
Geração além de imagens
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
Vídeo**
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<p>
Vídeo é um tensor 3D (tempo + 2D espaço). A teoria é idêntica à difusão de imagem, mas o custo é 10-100x maior. Um VAE 3D comprime o vídeo em latentes espaço-temporais. Um DiT processa patches com atenção fatorada: espacial dentro de cada frame, temporal entre frames (evitando O((THW)²)). Sora (OpenAI), Veo (Google), Kling (Kuaishou) e modelos abertos (CogVideoX, HunyuanVideo) usam essa arquitetura. O gargalo de produção é banda de memória.</p>
</div>
</div>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
Áudio**
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>
Áudio a 16-48 kHz gera sequências longas demais pra atenção direta. A solução: um codec neural (EnCodec, DAC, SoundStream) comprime o waveform em tokens discretos a 50-75 Hz via Residual Vector Quantization (RVQ). Um decoder-only transformer gera a sequência de tokens autoregressivamente (domina streaming) ou um modelo de flow matching gera em paralelo (melhor qualidade musical). MusicGen, Suno, ElevenLabs, todos usam codec + transformer.</p>
</div>
</div>
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
3D**
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>
Geração 3D é um problema de duas etapas. Primeiro, gere múltiplas visões 2D consistentes com difusão multi-view (Zero123, MVDream). Depois, ajuste uma representação 3D (Gaussian Splatting: nuvem de ~1M gaussianas com posição, covariância, opacidade e cor harmônica) pra casar com essas visões. O forward render projeta gaussianas 3D em elipses 2D e faz alpha compositing; o backward otimiza os parâmetros por gradiente descendente. Meshy 4 e Rodin Gen-1.5 pra assets de jogos; Hunyuan3D 2.0 pra e-commerce.</p>
</div>
</div>
</div>
</div>
